const desc1 = `<p>Дорожные битумы играют очень важную роль в строительстве автомобильных дорог. Они являются связующим звеном (вяжущим) для всех остальных компонентов асфальтобетона. От того какого качества будет битум зависит качество дорожного полотна и срок его службы.
БелКазТранс Украина поставляет всю номенклатуру битумов в соответствии с требованиями стандарта СТБ EN 12591.</p>
<p>Система производственного контроля нефтяных дорожных битумов сертифицирована в Евросоюзе. Битум дорожный соответствует требованиям европейского стандарта EN 12591-2009</p>
<p>Для того, что бы сделать заказ или проконсультироваться с нашими специалистами предлагаем Вам отправить нам сообщение и мы свяжемся с Вами.</p>
`;
const desc2 = `<p>Эмульсия «Elementum» — это битумная эмульсия анионного типа (мастика битумная эмульсионная) с применением специальных добавок.</p.
<p>Битумные эмульсии анионного типа широко применяются при производстве гидроизоляционных и кровельных работ. Они отличаются стойкостью при хранении, простотой в использовании, возможностью их использования в закрытых помещениях. Анионная битумная эмульсия не содержит в своем составе никаких растворителей.</p>
<p>Анионная битумная эмульсия «Elementum» может использоваться в качестве жидкого битумного праймера для подгрунтовки и пропитки основания перед нанесением слоя мастики или рулонных кровельных материалов.</p>
`;
const desc3 = `<p>Битумные эмульсии соответствуют требованиям стандарта СТБ 1245-2015.</p>
<p>Система производственного контроля производства битумных эмульсий сертифицирована на соответствие требованиям европейского стандарта EN 13808.</p>
<p>Вся поставляемая продукция предприятия сертифицирована.</p>
`;
const desc4 = `<p>Рост количества грузовых автомобилей и нагрузок на ось создает сложные условия для эксплуатации автомобильных дорог, особенно эта проблема актуальна на оживленных автомагистралях. Основная проблема, возникающая в связи с высокими осевыми нагрузками и большой интенсивностью движения, – деформация асфальтобетонных покрытий автомобильных дорог (колея).</p>
<p>Для повышения надежности и долговечности работы покрытий в настоящее время рекомендуется использовать битумы, модифицированные полимерами. Широкое использование модифицированных битумов вместо обычных объясняется их улучшенными свойствами. Асфальтобетоны, приготовленные с использованием полимерных битумов, имеют высокую устойчивость к деформациям за счет большой эластичности применяемых битумов. Кроме того, значительно замедляется процесс старения асфальтобетона.</p>
<p>Исследования зарубежных ученых показывают, что у битумов, извлеченных из дорожных покрытий, прослуживших 10 лет, не наблюдается существенных изменений вязкости.</p>
<p>Для улучшения свойств дорожных битумов (модификации) принято использовать SBS-полимеры. </p>
`;
const desc5 = `<p>БелКазТранс Украина поставляет мастики, основное предназначение которых, использование в качестве материала для ремонта и строительства дорог, аэродромов, искусственных сооружений, так же они могут применяться в строительстве в качестве гидроизоляционного материала.</p>
<p>Всем известна такая проблема на дорогах, как образование трещин. Благодаря заливке трещин мастикой дорожное покрытие надолго остается в таком состоянии, когда ремонтные работы могут подождать. </p>
`;
const desc6 = `<p>Мастики марок МБЭ (мастика битумно-эмульсионная), МБПЭ (мастика битумно-полимерная эмульсионная) применяют для устройства мастичных кровель, ремонта рулонных кровель и гидроизоляции строительных конструкций.</p>
<p>Мастика марки МБПГ (мастика битумно полимерная горячая) применяется для наклеивания рулонных кровельных и гидроизоляционных материалов, гидроизоляции строительных конструкций, а также устройства кровли с использованием армирующей прослойки.</p>
`;
const desc7 = `<p>Битум марки 40/180 используют, как правило, при производстве кровельных материалов</p>`;
const desc8 = `<p>Битумы нефтяные строительные 90/10 и 70/30 обладают высокими гидрофобными свойствами. Строительные битумы БН 90/10 и 70/30 характеризуется всеми необходимыми качествами и обеспечивают высокую защиту различных конструкций от неблагоприятного воздействия внешней среды, в том числе,  применение таких битумов гарантирует качественную битумную гидроизоляцию и создание дополнительного поля защиты от постоянных механических воздействий.</p>
<p>Они прекрасно подходят для создания обмазочной гидроизоляции различных строений – подвалов, фундаментов, межпанельных стыков, строительных и инженерных сооружений, гидроизоляции и ремонта кровли. А также для гидроизоляции и ремонта плоской (мягкой) кровли, в том числе для подготовки бетонного основания плоской кровли для укладки битумных наплавляемых материалов.</p>
<p>Позволяют прекрасно провести гидроизоляцию трубопроводов, канализационных и вспомогательных туннелей, мостов, шахт; наружной гидроизоляции конструкций зданий и сооружений из стали, кирпича, бетона, дерева, камня, и др. материалов.</p>
<p>Кроме того, битум широко используется для грунтования поверхностей перед наплавлением на них битумных рулонных материалов. При помощи битума также герметизируют стыки между рулонными материалами. Помимо этого, битум применяется для изготовления различных товаров – битумного праймера, битумных мастик, битумных гидроизоляционных кровельных и рулонных материалов.</p>
<p>Битумная гидроизоляция считается самой простой в применении и самой дешевой.</p>
`;
const desc9 = `<p>БелКазТранс Украина также поставляет фасованный битум.</p>
<p>На сегодняшний день существует несколько вариантов фасовки битума:</p>
<ol>
<li>Мешки Биг-Бэг из полипропилена с внутренним расплавляемым вкладышем массой 0,8-1 тонна.</li>
<li>Металлические бочки по 190 кг.</li>
<li>Кубовые контейнеры&nbsp; — кловертейнер массой 1 тонна.</li>
</ol>
`;
const desc10 = `<p>Данный продукт представляет собой специально подобранный состав для приготовления складируемых органо-минеральных смесей (СОМС), он включает в себя все необходимые компоненты — ПАВ, разжижитель и добавки улучшающие качественные показатели СОМС.</p>
<p>Вяжущее битумное комплексное используется на АБЗ как обычный битум, только при пониженной температуре — до 110 ºС.</p>
<p>Преимущество ВБК в том, что нет необходимости использовать дополнительные мешалки, а так же исключается возможность возгорания на АБЗ при добавлении дизельного топлива.</p>
`;

module.exports = {
  async up(db, client) {
    const data = [
      {
        title: 'Битум дорожный СТБ EN 12591',
        desc: desc1,
      },
      {
        title: 'Анионная битумная эмульсия «Elementum»',
        desc: desc2,
      },
      {
        title: 'Эмульсии битумные катионные дорожные',
        desc: desc3,
      },
      {
        title: 'Битум дорожный модифицированный',
        desc: desc4,
      },
      {
        title: 'Мастика герметизирующая битумно-эластомерная',
        desc: desc5,
      },
      {
        title: 'Мастики кровельные и гидроизоляционные',
        desc: desc6,
      },
      {
        title: 'Битум нефтяной кровельный 40/180',
        desc: desc7,
      },
      {
        title: 'Битум строительный нефтяной БН 90/10 и 70/30',
        desc: desc8,
      },
      {
        title: 'Фасованные битумы',
        desc: desc9,
      },
      {
        title: 'Вяжущее битумное комплексное',
        desc: desc10,
      },
    ]

    for(let d of data) {
      await db.collection('fuels').updateOne({titleRU: d.title}, {$set: {descriptionRU: d.desc}});
    }
  },

  async down(db, client) {
    // TODO write the statements to rollback your migration (if possible)
    // Example:
    // await db.collection('albums').updateOne({artist: 'The Beatles'}, {$set: {blacklisted: false}});
  }
};
