const desc1 = `<article class="product-content">
      <p class="caption">Бензин неэтилированный АИ-98-К5-Евро, выпускаемый по СТБ 1656-2011 соответствует:</p>
      <ul class="list">
        <li>- требованиям технического регламента Таможенного союза ТР ТС 013/2011 «О требованиях к автомобильному
          и авиационному бензину, дизельному и судовому топливу, топливу для реактивных двигателей и мазуту» в
          отношении экологического класса К5;
        </li>
        <li>- требованиям европейского стандарта EN 228 «Топлива для двигателей внутреннего сгорания.
          Неэтилированный бензин. Технические требования и методы испытаний»;
        </li>
        <li>- ДСТУ 7687:2015 «Бензини автомобільні ЄВРО. Технічні умови» в части требований к бензину
          А-98-Євро5-Е5:
        </li>
      </ul>
      <p class="caption">Более подробную информацию по бензину АИ-98-К5-Евро можно найти на сайте
        производителя.</p>
      <p class="site"><a href="#" target="_blank">www.mnpz.by</a></p>
      Ценообразование — по фиксированным ценам/ поставки по формульному ценообразованию, основанного на котировках
      международных бирж (котировки агентств “Argus” и “Platts”).
    </article>`;
const desc2 = `<article class="product-content">
      <p class="caption">Бензин неэтилированный АИ-95-К5-Евро, выпускаемый по СТБ 1656-2011 соответствует:</p>
      <ul class="list">
        <li>- требованиям технического регламента Таможенного союза ТР ТС 013/2011 «О требованиях к автомобильному
          и авиационному бензину, дизельному и судовому топливу, топливу для реактивных двигателей и мазуту» в
          отношении экологического класса К5;
        </li>
        <li>- требованиям европейского стандарта EN 228 «Топлива для двигателей внутреннего сгорания.
          Неэтилированный бензин. Технические требования и методы испытаний»;
        </li>
        <li>- ДСТУ 7687:2015 «Бензини автомобільні ЄВРО. Технічні умови» в части требований к бензину
          А-95-Євро5-Е5:
        </li>
      </ul>
      <p class="caption">Более подробную информацию по бензину АИ-95-К5-Евро можно найти на сайте
        производителя.</p>
      <p class="site"><a href="#" target="_blank">www.mnpz.by</a></p>
      Ценообразование — по фиксированным ценам/ поставки по формульному ценообразованию, основанного на котировках
      международных бирж (котировки агентств “Argus” и “Platts”).
    </article>`;
const desc3 = `<article class="product-content">
      <p class="caption">Бензин неэтилированный АИ-92-К5-Евро, выпускаемый по СТБ 1656-2011 соответствует:</p>
      <ul class="list">
        <li>- требованиям технического регламента Таможенного союза ТР ТС 013/2011 «О требованиях к автомобильному
          и авиационному бензину, дизельному и судовому топливу, топливу для реактивных двигателей и мазуту» в
          отношении экологического класса К5;
        </li>
        <li>- требованиям европейского стандарта EN 228 «Топлива для двигателей внутреннего сгорания.
          Неэтилированный бензин. Технические требования и методы испытаний»;
        </li>
        <li>- ДСТУ 7687:2015 «Бензини автомобільні ЄВРО. Технічні умови» в части требований к бензину
          А-92-Євро5-Е5:
        </li>
      </ul>
      <p class="caption">Более подробную информацию по бензину АИ-92-К5-Евро можно найти на сайте
        производителя.</p>
      <p class="site"><a href="#" target="_blank">www.mnpz.by</a></p>
      Ценообразование — по фиксированным ценам/ поставки по формульному ценообразованию, основанного на котировках
      международных бирж (котировки агентств “Argus” и “Platts”).
    </article>`;
const desc4 = `<article class="product-content">
                    <p class="caption">Cоответствует:</p>
                    <ul class="list">
                        <li>- Дизельное топливо — продукт, который производят путем отделения из нефти керосиново-газойлевых фракций по СТБ 1658-2015. Предназначено для применения в дизельных двигателях внутреннего сгорания с воспламенением топливно-воздушной смеси от сжатия. Качество дизельного топлива соответствует:</li>
                        <li>- требованиям технического регламента Таможенного союза ТР ТС 013/2011 «О требованиях к автомобильному и авиационному бензину, дизельному и судовому топливу, топливу для реактивных двигателей и мазуту» в отношении экологического класса К5.</li>
                        <li>- требованиям европейского стандарта EN 590 «Топлива для двигателей внутреннего сгорания. Топливо дизельное. Технические требования и методы испытаний».</li>
                    </ul>
                    <p class="caption">Более подробную информацию по бензину АИ-92-К5-Евро можно найти на сайте производителя.</p>
                    <p class="site"><a href="#" target="_blank">www.mnpz.by</a></p>
                    Ценообразование — по фиксированным ценам/ поставки по формульному ценообразованию, основанного на котировках международных бирж (котировки агентств “Argus” и “Platts”).
                </article>`;
const desc5 = `<article class="product-content">
                    <p><span class="semibold">Битумы нефтяные дорожные</span> — продукт, который получают путем окисления остатков атмосферно-вакуумной перегонки нефти и селективного разделения нефтепродуктов (асфальтов деасфальтизации, экстрактов селективной очистки), а также компаундированием высоковязких окисленных и не окисленных продуктов или прямой перегонкой нефти (битумы). Самое широкое применение материал получил в области строительства и ремонта дорожного покрытия во всех дорожно-климатических районах Украины.</p>
                    <p>Битумы дорожные предназначены для применения при строительстве и ремонте дорожных, аэродромных и других асфальтобетонных покрытий.</p>
                </article>`;

const darkDescRU1 = `<article class="product-content">Дорожные битумы играют очень важную роль в строительстве автомобильных дорог. Они являются связующим звеном (вяжущим) для всех остальных компонентов асфальтобетона. От того какого качества будет битум зависит качество дорожного полотна и срок его службы.<p></p>
<p>Унитарное предприятие «Нефтебитумный завод» производит всю номенклатуру битумов в соответствии с требованиями стандарта СТБ EN 12591, а по некоторым показателям, даже превосходит их.</p>
<p>Система производственного контроля нефтяных дорожных битумов сертифицирована в Евросоюзе.&nbsp;Битум дорожный соответствует требованиям европейского стандарта EN 12591-2009</p>
<p>Для того, что бы сделать заказ или проконсультироваться с нашими специалистами предлагаем Вам отправить нам сообщение и мы свяжемся с Вами.</p>
</article>`;
const darkDescRU2 = `<article class="product-content">Эмульсия «Elementum» — это битумная эмульсия анионного типа&nbsp;(мастика битумная эмульсионная) с применением специальных добавок , разработанная специалистами нашего предприятия.<br>
Битумные эмульсии анионного типа широко применяются при производстве гидроизоляционных и кровельных работ. Они отличаются стойкостью при хранении, простотой в использовании, возможностью их использования в закрытых помещениях. Анионная битумная эмульсия не содержит в своем составе никаких растворителей.<br>
Анионная битумная эмульсия «Elementum» может использоваться в качестве жидкого битумного праймера для подгрунтовки и пропитки основания перед нанесением слоя мастики или рулонных кровельных материалов.</article>`;
const darkDescRU3 = `<article class="product-content">Унитарное предприятие «Нефтебитумный завод» является одним из крупнейших производителей битумных эмульсий для ремонта и строительства дорог в Республике Беларусь и Восточной Европе.<p></p>
<p>Специалисты нашего предприятия производят битумные эмульсии с 1998 года. При производстве битумных эмульсий мы используем только лучшие материалы от всемирноизвестных производителей.</p>
<p>Битумные эмульсии&nbsp;соответствуют требованиям стандарта СТБ 1245-2015.</p>
<p>Система производственного контроля производства битумных эмульсий сертифицирована на соответствие требованиям европейского стандарта EN 13808.</p>
<p>Вся продукция предприятия сертифицирована.</p>
<p>&nbsp;</p>
</article>`;
const darkDescRU4 = `<article class="product-content">Рост количества грузовых автомобилей и нагрузок на ось создает сложные условия для эксплуатации автомобильных дорог, особенно эта проблема актуальна на оживленных автомагистралях (М1/Е30, дороги республиканского значения, улицы крупных городов). Основная проблема, возникающая в связи с высокими осевыми нагрузками и большой интенсивностью движения, – деформация асфальтобетонных покрытий автомобильных дорог (колея).<div class="gap nz-clearfix" style="height:25px">&nbsp;</div>
<p>Для повышения надежности и долговечности работы покрытий в настоящее время рекомендуется использовать битумы, модифицированные полимерами. Широкое использование модифицированных битумов вместо обычных объясняется их улучшенными свойствами. Асфальтобетоны, приготовленные с использованием полимерных битумов, имеют высокую устойчивость к деформациям за счет большой эластичности применяемых битумов. Кроме того, значительно замедляется процесс старения асфальтобетона.</p>
<p>Исследования зарубежных ученых показывают, что у битумов, извлеченных из дорожных покрытий, прослуживших 10 лет, не наблюдается существенных изменений вязкости.</p>
<p>Для улучшения свойств дорожных битумов (модификации) принято использовать SBS-полимеры. Унитарное предприятие «Нефтебитумный завод» предлагает модифицированные битумы по параметрам указанным в таблице.</p></article>`;
const darkDescRU5 = `<article class="product-content">Унитарное предприятие «Нефтебитумный завод» производит мастики, основное предназначение которых, использование в качестве материала для ремонта и строительства дорог, аэродромов, искусственных сооружений, так же они могут применяться в строительстве в качестве гидроизоляционного материала.<p></p>
<p>&nbsp;</p>
<p>Всем известна такая проблема на дорогах, как образование трещин. Благодаря заливке трещин мастикой дорожное покрытие надолго остается в таком состоянии, когда ремонтные работы могут подождать. Нашим предприятием так же производится мастика для заливки швов цементобетонного дорожного полотна и аэродромов. Сравнительные параметры для мастик приведены в таблице.</p>
</article>`;
const darkDescRU6 = `<article class="product-content">Мастики кровельные и гидроизоляционные.<p></p>
<p><strong>Мастики марок МБЭ (мастика битумно-эмульсионная), МБПЭ (мастика битумно-полимерная эмульсионная)</strong> применяют для устройства мастичных кровель, ремонта рулонных кровель и гидроизоляции строительных конструкций.</p>
<p><strong>Мастика марки МБПГ (мастика битумно полимерная горячая) </strong>применяется для наклеивания рулонных кровельных и гидроизоляционных материалов, гидроизоляции строительных конструкций, а также устройства кровли с использованием армирующей прослойки.</p>
<p>Пример применения мастики битумно-полимерной эмульсионной (жидкая резина) при гидроизоляции силосной траншеи механизированным способом.</p>
</article>`;
const darkDescRU7 = `<article class="product-content">Битум марки 40/180 используют,как правило, при производстве кровельных материалов.<p></p></article>`;
const darkDescRU8 = `<article class="product-content">Битумы нефтяные строительные 90/10 и 70/30 обладают высокими гидрофобными свойствами. Строительные битумы БН 90/10 и 70/30 характеризуется всеми необходимыми качествами и обеспечивают высокую защиту различных конструкций от неблагоприятного воздействия внешней среды, в том числе,&nbsp; применение таких битумов гарантирует качественную битумную гидроизоляцию и создание дополнительного поля защиты от постоянных механических воздействий.<p></p>
<p>Они прекрасно подходят для создания обмазочной гидроизоляции различных строений – подвалов, фундаментов, межпанельных стыков, строительных и инженерных сооружений, гидроизоляции и ремонта кровли. А также для гидроизоляции и ремонта плоской (мягкой) кровли, в том числе для подготовки бетонного основания плоской кровли для укладки битумных наплавляемых материалов.</p>
<p>Позволяют прекрасно провести гидроизоляцию трубопроводов, канализационных и вспомогательных туннелей, мостов, шахт; наружной гидроизоляции конструкций зданий и сооружений из стали, кирпича, бетона, дерева, камня, и др. материалов.</p>
<p>Кроме того, битум широко используется для грунтования поверхностей перед наплавлением на них битумных рулонных материалов. При помощи битума также герметизируют стыки между рулонными материалами. Помимо этого, битум применяется для изготовления различных товаров – битумного праймера, битумных мастик, битумных гидроизоляционных кровельных и рулонных материалов.</p>
<p>Битумная гидроизоляция считается самой простой в применении и самой дешевой.</p>
<div></div>
<div>
<table border="1" cellspacing="1" cellpadding="1">
<tbody>
<tr>
<td style="text-align: center;" colspan="1" rowspan="2"><strong>Наименование показателя</strong></td>
<td colspan="2" rowspan="1"><strong>Норма для марок</strong></td>
</tr>
<tr>
<td style="text-align: center;"><strong>90/10</strong></td>
<td style="text-align: center;"><strong>70/30</strong></td>
</tr>
<tr>
<td>
<div>Глубина проникания иглы при&nbsp;25 °C, 0,1 мм</div>
</td>
<td style="text-align: center;">5-20</td>
<td style="text-align: center;">21-40</td>
</tr>
<tr>
<td>
<div>Температура размягчения по&nbsp;кольцу и шару, °C</div>
</td>
<td style="text-align: center;">90-105</td>
<td style="text-align: center;">70-80</td>
</tr>
<tr>
<td>
<div>Растяжимость при 25°C, не&nbsp;менее</div>
</td>
<td style="text-align: center;">1,0</td>
<td style="text-align: center;">3,0</td>
</tr>
<tr>
<td>Растворимость, %, не менее</td>
<td style="text-align: center;">99,50</td>
<td style="text-align: center;">99,50</td>
</tr>
<tr>
<td>
<div>Изменение массы после&nbsp;прогрева, %, не более</div>
</td>
<td style="text-align: center;">0,50</td>
<td style="text-align: center;">0,50</td>
</tr>
<tr>
<td>
<div>Температура вспышки, °C, не&nbsp;ниже</div>
</td>
<td style="text-align: center;">240</td>
<td style="text-align: center;">240</td>
</tr>
<tr>
<td>Массовая доля воды</td>
<td style="text-align: center;" colspan="2" rowspan="1">следы</td>
</tr>
</tbody>
</table>
</div>
<div></div>
<div></div>
<div>Мы расфасовываем строительный битум в коробки по 20-22 кг каждая. Для того, что бы Вам удобнее было с ним работать, битум фасуется в антиадгезионный вкладыш. Благодаря ему, нет необходимости вылавливать пленку или куски бумаги в кипящем котле — битум остается в чистом виде, т.к. вкладыш легко удаляется</div>
<p></p></article>`;
const darkDescRU9 = `<article class="product-content">Унитарное предприятие «Нефтебитумный завод» предлагает потребителям своей продукции рассмотреть вопрос о приобретении фасованного битума.<p></p>
<p>&nbsp;</p>
<p>На сегодняшний день существует несколько вариантов фасовки битума:</p>
<ol>
<li>Мешки Биг-Бэг из полипропилена с внутренним расплавляемым вкладышем массой 0,8-1 тонна.</li>
<li>Металлические бочки по 190 кг.</li>
<li>Кубовые контейнеры&nbsp; — кловертейнер массой 1 тонна.</li>
</ol>
<p></p></article>`;
const darkDescRU10 = `<article class="product-content">В сотрудничестве с институтом РУП «БелдорНИИ» наше предприятие разработало новый продукт&nbsp; — <strong>вяжущее битумное комплексное (ВБК)</strong>.<p></p>
<p>Данный продукт представляет собой специально подобранный состав для приготовления складируемых органо-минеральных смесей (СОМС), он включает в себя все необходимые компоненты — ПАВ, разжижитель и добавки улучшающие качественные показатели СОМС.</p>
<p>Вяжущее битумное комплексное используется на АБЗ как обычный битум, только при пониженной температуре — до 110 ºС.</p>
<p>Преимущество ВБК в том, что нет необходимости использовать дополнительные мешалки,а так же исключается возможность возгорания на АБЗ при добавлении дизельного топлива.</p></article>`;

module.exports = {
  async up(db, client) {
      const data = [
        {
          "titleEN": "Железнодорожное экспедирование грузов",
          "titleRU": "Железнодорожное экспедирование грузов",
          "titleUA": "Железнодорожное экспедирование грузов",
          "code": "cargo",
          "fuels": [
          ]
        },
        {
          "titleEN": "Импорт светлых нефтепродуктов",
          "titleRU": "Импорт светлых нефтепродуктов",
          "titleUA": "Импорт светлых нефтепродуктов",
          "code": "light",
          "fuels": [
            {
              "titleEN": "Бензин неэтилированный А-98-К5-Евро",
              "titleRU": "Бензин неэтилированный А-98-К5-Евро",
              "titleUA": "Бензин неэтилированный А-98-К5-Евро",
              "price": 1200,
              "shortTitleEN": "Бензины А98",
              "shortTitleUA": "Бензины А98",
              "shortTitleRU": "Бензины А98",

              "descriptionEN": desc1,
              "descriptionUA": desc1,
              "descriptionRU": desc1
            },
            {
              "titleEN": "Бензин неэтилированный А-95-К5-Евро",
              "titleRU": "Бензин неэтилированный А-95-К5-Евро",
              "titleUA": "Бензин неэтилированный А-95-К5-Евро",
              "price": 1200,
              "shortTitleEN": "Бензины А95",
              "shortTitleUA": "Бензины А95",
              "shortTitleRU": "Бензины А95",

              "descriptionEN": desc2,
              "descriptionUA": desc2,
              "descriptionRU": desc2
            },
            {
              "titleEN": "Бензин неэтилированный А-92-К5-Евро",
              "titleRU": "Бензин неэтилированный А-92-К5-Евро",
              "titleUA": "Бензин неэтилированный А-92-К5-Евро",
              "price": 1100,
              "shortTitleEN": "Бензины А92",
              "shortTitleUA": "Бензины А92",
              "shortTitleRU": "Бензины А92",

              "descriptionEN": desc3,
              "descriptionUA": desc3,
              "descriptionRU": desc3
            },
            {
              "titleEN": "Дизельное топливо",
              "titleRU": "Дизельное топливо",
              "titleUA": "Дизельное топливо",
              "price": 1200,
              "shortTitleEN": "Дизельное топливо",
              "shortTitleUA": "Дизельное топливо",
              "shortTitleRU": "Дизельное топливо",

              "descriptionEN": desc4,
              "descriptionUA": desc4,
              "descriptionRU": desc4
            }
          ]
        },
        {
          "titleEN": "Импорт темных нефтепродуктов",
          "titleRU": "Импорт темных нефтепродуктов",
          "titleUA": "Импорт темных нефтепродуктов",
          "code": "dark",
          "fuels": [
            {
              "titleEN": "Битум дорожный СТБ EN 12591",
              "titleRU": "Битум дорожный СТБ EN 12591",
              "titleUA": "Битум дорожный СТБ EN 12591",
              "price": 1200,
              "shortTitleEN": "Битум дорожный СТБ EN 12591",
              "shortTitleUA": "Битум дорожный СТБ EN 12591",
              "shortTitleRU": "Битум дорожный СТБ EN 12591",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU1
            },
            {
              "titleEN": "Анионная битумная эмульсия «Elementum»",
              "titleRU": "Анионная битумная эмульсия «Elementum»",
              "titleUA": "Анионная битумная эмульсия «Elementum»",
              "price": 1200,
              "shortTitleEN": "Анионная битумная эмульсия «Elementum»",
              "shortTitleUA": "Анионная битумная эмульсия «Elementum»",
              "shortTitleRU": "Анионная битумная эмульсия «Elementum»",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU2
            },
            {
              "titleEN": "Эмульсии битумные катионные дорожные",
              "titleRU": "Эмульсии битумные катионные дорожные",
              "titleUA": "Эмульсии битумные катионные дорожные",
              "price": 1200,
              "shortTitleEN": "Эмульсии битумные катионные дорожные",
              "shortTitleUA": "Эмульсии битумные катионные дорожные",
              "shortTitleRU": "Эмульсии битумные катионные дорожные",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU3
            },{
              "titleEN": "Битум дорожный модифицированный",
              "titleRU": "Битум дорожный модифицированный",
              "titleUA": "Битум дорожный модифицированный",
              "price": 1200,
              "shortTitleEN": "Битум дорожный модифицированный",
              "shortTitleUA": "Битум дорожный модифицированный",
              "shortTitleRU": "Битум дорожный модифицированный",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU4
            },
            {
              "titleEN": "Мастика герметизирующая битумно-эластомерная",
              "titleRU": "Мастика герметизирующая битумно-эластомерная",
              "titleUA": "Мастика герметизирующая битумно-эластомерная",
              "price": 1200,
              "shortTitleEN": "Мастика герметизирующая битумно-эластомерная",
              "shortTitleUA": "Мастика герметизирующая битумно-эластомерная",
              "shortTitleRU": "Мастика герметизирующая битумно-эластомерная",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU5
            },
            {
              "titleEN": "Мастики кровельные и гидроизоляционные",
              "titleRU": "Мастики кровельные и гидроизоляционные",
              "titleUA": "Мастики кровельные и гидроизоляционные",
              "price": 1200,
              "shortTitleEN": "Мастики кровельные и гидроизоляционные",
              "shortTitleUA": "Мастики кровельные и гидроизоляционные",
              "shortTitleRU": "Мастики кровельные и гидроизоляционные",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU6
            },
            {
              "titleEN": "Битум нефтяной кровельный 40/180",
              "titleRU": "Битум нефтяной кровельный 40/180",
              "titleUA": "Битум нефтяной кровельный 40/180",
              "price": 1200,
              "shortTitleEN": "Битум нефтяной кровельный 40/180",
              "shortTitleUA": "Битум нефтяной кровельный 40/180",
              "shortTitleRU": "Битум нефтяной кровельный 40/180",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU7
            },
            {
              "titleEN": "Битум строительный нефтяной БН 90/10 и 70/30",
              "titleRU": "Битум строительный нефтяной БН 90/10 и 70/30",
              "titleUA": "Битум строительный нефтяной БН 90/10 и 70/30",
              "price": 1200,
              "shortTitleEN": "Битум строительный нефтяной БН 90/10 и 70/30",
              "shortTitleUA": "Битум строительный нефтяной БН 90/10 и 70/30",
              "shortTitleRU": "Битум строительный нефтяной БН 90/10 и 70/30",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU8
            },
            {
              "titleEN": "Фасованные битумы",
              "titleRU": "Фасованные битумы",
              "titleUA": "Фасованные битумы",
              "price": 1200,
              "shortTitleEN": "Фасованные битумы",
              "shortTitleUA": "Фасованные битумы",
              "shortTitleRU": "Фасованные битумы",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU9
            },
            {
              "titleEN": "Вяжущее битумное комплексное",
              "titleRU": "Вяжущее битумное комплексное",
              "titleUA": "Вяжущее битумное комплексное",
              "price": 1200,
              "shortTitleEN": "Вяжущее битумное комплексное",
              "shortTitleUA": "Вяжущее битумное комплексное",
              "shortTitleRU": "Вяжущее битумное комплексное",

              "descriptionEN": "string",
              "descriptionUA": "string",
              "descriptionRU": darkDescRU10
            },
          ]
        }
      ];

      for(let d of data) {
        d.fuels = await db.collection('fuels').insertMany(d.fuels);
        await db.collection('products').create(d);
      }
    },

  async down(db, client) {
    await db.collection('products')
      .deleteOne({
        code: "cargo"
      });
    await db.collection('products')
      .deleteOne({
        code: "light"
      });
    await db.collection('products')
      .deleteOne({
        code: "dark"
      });
  }
};
